--测试
--[[
	神奇的注释
	"呵呵"
]]

--[[ 是不是注释啊？
	“这是注释哦"
]]
---[[ 是不是注释啊？
	str0 = "这不是注释哦"
--]]
str1 = "测试1"
str7 = '<font color=\'#6999ff\'>%s</font>，你终于醒了'
str2 = "测试 测试2 \
 测试测试3"
str8 = "为什么'屠龙刀'不生锈？"

str3 = '测试4'
str9 = [[因为屠龙刀不是用铁做的\n，是用一种‘铜’]]
str4 = ' 测试5 \
 测试6 '
str10 = [[是什么\n\r样的“铜”]]
str5 = [[测试7]]
str11 = "不知道这个要问[[金庸]]"
str6 = [[多行字符串

 对是的]]
str12 = '[[金庸]]是谁能吃吗？'
str13 = '他是"人"，你觉得能吃吗？'
str14 = [[有'完'没"完"呢]]
str15 = "[[明显]]是'没完了'\r，你觉得呢？"
str16 = '[[我]]怎么“知道”哦'
str17 = ""
str18 = ''
str19 = [[]]
str20 = "测试1"--测试
str21 = "特殊同时\\"
---------------------------